<a href="https://colab.research.google.com/github/tolutopea/Python_Dataframes/blob/master/Python_DataFrames_Statistics.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
from sqlalchemy import create_engine
import pandas as pd
from scipy import stats

# Database credentials
postgres_user = 'dabc_student'
postgres_pw = '7*.8G9QH21'
postgres_host = '142.93.121.174'
postgres_port = '5432'
postgres_db = 'kickstarterprojects'

# use the credentials to start a connection
engine = create_engine('postgresql://{}:{}@{}:{}/{}'.format(
    postgres_user, postgres_pw, postgres_host, postgres_port, postgres_db))

/usr/local/lib/python3.6/dist-packages/psycopg2/__init__.py:144: UserWarning: The psycopg2 wheel package will be renamed from release 2.8; in order to keep installing from binary please use "pip install psycopg2-binary" instead. For details see: <http://initd.org/psycopg/docs/install.html#binary-install-from-pypi>.
  """)

In [0]:
projects_df = pd.read_sql_table('ksprojects', con=engine)

# remove the connection
engine.dispose()
projects_df.shape

(65418, 13)

In [0]:
projects_df.head()

           id  ...  pledged
0  1147015301  ...    40.00
1  1100844465  ...   700.00
2  1316334968  ...  1367.00
3  1304906577  ...  6575.00
4  1099226462  ...   501.66

[5 rows x 13 columns]

In [0]:
# count the number of unique values in this column
projects_df['category'].nunique()

158

In [0]:
# Let's do the same for the main_category column.

projects_df['main_category'].nunique()

15

In [0]:
main_category_counts = projects_df['main_category'].value_counts()
main_category_counts

Film & Video    11666
Music            9395
Publishing       6901
Games            5739
Technology       5328
Art              4843
Design           4798
Food             4343
Fashion          3700
Theater          2015
Photography      1933
Comics           1791
Crafts           1474
Journalism        811
Dance             681
Name: main_category, dtype: int64

In [0]:
category_counts = projects_df['category'].value_counts()
category_counts.head(10)

Product Design    3444
Documentary       2969
Music             2740
Shorts            2407
Tabletop Games    2208
Food              2126
Video Games       2011
Film & Video      1828
Fiction           1670
Fashion           1584
Name: category, dtype: int64

In [0]:
projects_df['main_category'].nunique()

15

In [0]:
main_category_counts = projects_df['main_category'].value_counts()

# there are only 15 main categories so print them all
main_category_counts

Film & Video    11666
Music            9395
Publishing       6901
Games            5739
Technology       5328
Art              4843
Design           4798
Food             4343
Fashion          3700
Theater          2015
Photography      1933
Comics           1791
Crafts           1474
Journalism        811
Dance             681
Name: main_category, dtype: int64

In [0]:
# how many countries
projects_df['country'].nunique()

22

In [0]:
# how are the projects distributed over the countries
country_counts = projects_df['country'].value_counts()
country_counts

US      52071
GB       5617
CA       2404
AU       1258
N,"0      744
DE        538
NL        457
FR        397
IT        374
ES        294
SE        267
NZ        236
DK        157
NO        120
IE         99
AT         98
BE         90
CH         88
MX         43
SG         29
HK         26
LU         11
Name: country, dtype: int64

In [0]:
null_rows = projects_df[projects_df.isnull().any(axis=1)]
null_rows.head(10)

               id  ...  pledged
9490   1189637889  ...  2621.00
15111  1244477824  ...   500.00
17484  1084993156  ...  4593.00
17532  1379649454  ...  5250.00
27334  1349042579  ...  6168.00
27443  1205956740  ...  1042.00
27522  1125500286  ...  3225.00
27574  1292835145  ...  3032.88
27602  1092574678  ...  1552.00
27755  1061706792  ...  5305.00

[10 rows x 13 columns]

In [0]:
null_rows.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 745 entries, 9490 to 59365
Data columns (total 13 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id             745 non-null    int64
 1   name           745 non-null    object
 2   category       745 non-null    object
 3   main_category  745 non-null    object
 4   deadline       745 non-null    datetime64[ns]
 5   goal           745 non-null    float64
 6   launched       745 non-null    datetime64[ns]
 7   state          745 non-null    object
 8   backers        745 non-null    int64
 9   country        745 non-null    object
 10  usd_pledged    0 non-null      float64
 11  currency       745 non-null    object
 12  pledged        745 non-null    float64
dtypes: datetime64[ns](2), float64(3), int64(2), object(6)
memory usage: 81.5+ KB

In [0]:
zero_filled = null_rows.fillna(0)
zero_filled.head(10)

               id  ...  pledged
9490   1189637889  ...  2621.00
15111  1244477824  ...   500.00
17484  1084993156  ...  4593.00
17532  1379649454  ...  5250.00
27334  1349042579  ...  6168.00
27443  1205956740  ...  1042.00
27522  1125500286  ...  3225.00
27574  1292835145  ...  3032.88
27602  1092574678  ...  1552.00
27755  1061706792  ...  5305.00

[10 rows x 13 columns]

In [0]:
# print the original size of the DataFrame
print(projects_df.size)

# drop NaN rows
clean_projects = projects_df.dropna()

# print the size of the modified DataFrame
print(clean_projects.size)

850434
840749

In [0]:
series_statistics(clean_projects['goal'])
def series_statistics(column):
  print('statistics for column: {}'.format(column.name))
  print('The max value in the column: {}'.format(column.max()))
  print('The min value in the column: {}'.format(column.min()))
  print('The mode value in the column: {}'.format(column.mode()))
  print('The median value in the column: {}'.format(column.median()))
  print('The mean of the column: {}'.format(column.mean()))
  print('The std of the column: {}'.format(column.std()))

statistics for column: goal
The max value in the column: 100000000.0
The min value in the column: 1.0
The mode value in the column: 0    5000.0
dtype: float64
The median value in the column: 5000.0
The mean of the column: 42094.83745674393
The std of the column: 1033205.2738987174

In [0]:
series_statistics(clean_projects['usd_pledged'])

statistics for column: usd_pledged
The max value in the column: 8596480.0
The min value in the column: 0.0
The mode value in the column: 0    0.0
dtype: float64
The median value in the column: 542.0
The mean of the column: 7900.242114883215
The std of the column: 72783.34386006395

In [0]:
clean_projects['goal'].describe()

count    6.467300e+04
mean     4.209484e+04
std      1.033205e+06
min      1.000000e+00
25%      2.000000e+03
50%      5.000000e+03
75%      1.500000e+04
max      1.000000e+08
Name: goal, dtype: float64

In [0]:
clean_projects[['goal', 'usd_pledged', 'backers']].describe()

               goal   usd_pledged        backers
count  6.467300e+04  6.467300e+04   64673.000000
mean   4.209484e+04  7.900242e+03     104.336091
std    1.033205e+06  7.278334e+04     994.725411
min    1.000000e+00  0.000000e+00       0.000000
25%    2.000000e+03  2.500000e+01       2.000000
50%    5.000000e+03  5.420000e+02      13.000000
75%    1.500000e+04  3.608380e+03      56.000000
max    1.000000e+08  8.596480e+06  154926.000000

In [0]:
clean_projects['goal'].corr(clean_projects['usd_pledged'])

0.006423740131433384

In [0]:
clean_projects[['goal', 'usd_pledged', 'backers']].corr()

                 goal  usd_pledged   backers
goal         1.000000     0.006424  0.003033
usd_pledged  0.006424     1.000000  0.569047
backers      0.003033     0.569047  1.000000

In [0]:
Independent Samples t-test

In [0]:
# Database credentials
postgres_user = 'dabc_student'
postgres_pw = '7*.8G9QH21'
postgres_host = '142.93.121.174'
postgres_port = '5432'
postgres_db = 'baseball'

# use the credentials to start a connection
engine = create_engine('postgresql://{}:{}@{}:{}/{}'.format(
    postgres_user, postgres_pw, postgres_host, postgres_port, postgres_db))

# SQL to select players and salaries
sql = 'SELECT p.playerid, birthyear, birthcountry, deathyear, namefirst, namelast, weight, height, bats, throws, yearid, teamid, lgid, salary FROM people p join salaries s on p.playerid = s.playerid'


# Use the query to create a DataFrame
players_df = pd.read_sql_query(sql, con=engine)

# remove the connection
engine.dispose()

# print 2 rows to see what we got
players_df.head(2)

    playerid  birthyear birthcountry  deathyear  ... yearid teamid  lgid  salary
0  barkele01       1955          USA        NaN  ...   1985    ATL    NL  870000
1  bedrost01       1957          USA        NaN  ...   1985    ATL    NL  550000

[2 rows x 14 columns]

In [0]:
players_1990 = players_df.iloc[(players_df['yearid'] == 1990).values]
players_1990.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 867 entries, 3289 to 4155
Data columns (total 14 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   playerid      867 non-null    object
 1   birthyear     867 non-null    int64
 2   birthcountry  867 non-null    object
 3   deathyear     36 non-null     float64
 4   namefirst     867 non-null    object
 5   namelast      867 non-null    object
 6   weight        867 non-null    int64
 7   height        867 non-null    int64
 8   bats          867 non-null    object
 9   throws        867 non-null    object
 10  yearid        867 non-null    int64
 11  teamid        867 non-null    object
 12  lgid          867 non-null    object
 13  salary        867 non-null    int64
dtypes: float64(1), int64(5), object(8)
memory usage: 101.6+ KB

In [0]:
players_2000 = players_df.iloc[(players_df['yearid'] == 2000).values]
players_2000.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 836 entries, 12263 to 13098
Data columns (total 14 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   playerid      836 non-null    object
 1   birthyear     836 non-null    int64
 2   birthcountry  836 non-null    object
 3   deathyear     10 non-null     float64
 4   namefirst     836 non-null    object
 5   namelast      836 non-null    object
 6   weight        836 non-null    int64
 7   height        836 non-null    int64
 8   bats          836 non-null    object
 9   throws        836 non-null    object
 10  yearid        836 non-null    int64
 11  teamid        836 non-null    object
 12  lgid          836 non-null    object
 13  salary        836 non-null    int64
dtypes: float64(1), int64(5), object(8)
memory usage: 98.0+ KB

In [0]:
stats.ttest_ind(players_1990['salary'], players_2000['salary'])

Ttest_indResult(statistic=-16.90651573407297, pvalue=2.1593870550905857e-59)

In [0]:
sample_1_n = players_1990.shape[0]
sample_2_n = players_2000.shape[0]
sample_1_mean = players_1990['salary'].mean()
sample_2_mean = players_2000['salary'].mean()
sample_1_var = players_1990['salary'].var()
sample_2_var = players_2000['salary'].var()

In [0]:
# Calculate the standard error and compute the confidence intervals

import math
std_err_difference = math.sqrt((sample_1_var/sample_1_n)+(sample_2_var/sample_2_n))

mean_difference = sample_2_mean - sample_1_mean

margin_of_error = 1.96 * std_err_difference
ci_lower = mean_difference - margin_of_error
ci_upper = mean_difference + margin_of_error

print("The difference in means at the 95% confidence interval is between "+str(ci_lower)+" and "+str(ci_upper)+".")

The difference in means at the 95% confidence interval is between 1306451.096390415 and 1655570.6584535995.

In [0]:
def get_95_ci(array_1, array_2):
    sample_1_n = array_1.shape[0]
    sample_2_n = array_2.shape[0]
    sample_1_mean = array_1.mean()
    sample_2_mean = array_2.mean()
    sample_1_var = array_1.var()
    sample_2_var = array_2.var()
    mean_difference = sample_2_mean - sample_1_mean
    std_err_difference = math.sqrt((sample_1_var/sample_1_n)+(sample_2_var/sample_2_n))
    margin_of_error = 1.96 * std_err_difference
    ci_lower = mean_difference - margin_of_error
    ci_upper = mean_difference + margin_of_error
    return("The difference in means at the 95% confidence interval (two-tail) is between "+str(ci_lower)+" and "+str(ci_upper)+".")

get_95_ci(players_1990['salary'],players_2000['salary'])

'The difference in means at the 95% confidence interval (two-tail) is between 1306451.096390415 and 1655570.6584535995.'